INSERT INTO City (Name, Region)
VALUES ('Москва', 'Центральный федеральный округ'),
       ('Санкт-Петербург', 'Северо-Западный федеральный округ'),
       ('Тверь', 'Центральный федеральный округ');

INSERT INTO Station (Name, TracksCount, CityName, Region)
VALUES ('Москва', 10, 'Москва', 'Центральный федеральный округ'),
       ('Санкт-Петербург', 12, 'Санкт-Петербург', 'Северо-Западный федеральный округ'),
       ('Тверь', 8, 'Тверь', 'Центральный федеральный округ');

INSERT INTO Train (TrainNr, Length, StartStationName, EndStationName)
VALUES (101, 500, 'Москва', 'Санкт-Петербург'),
       (102, 300, 'Москва', 'Тверь'),
       (103, 400, 'Тверь', 'Санкт-Петербург');

INSERT INTO Connection (FromStation, ToStation, TrainNr, Departure, Arrival)
VALUES ('Москва', 'Тверь', 102, '2024-10-15 08:00:00', '2024-10-15 10:00:00'),
       ('Тверь', 'Санкт-Петербург', 103, '2024-10-15 11:00:00', '2024-10-15 13:00:00'),
       ('Москва', 'Санкт-Петербург', 101, '2024-10-15 08:00:00', '2024-10-15 12:00:00');
